[
  {
    "path": "posts/2021-07-09-assignment/",
    "title": "Assignment",
    "description": "This is a assignment of ISSS608 Visual Analytics and Application. In this assignment, we would like to explor VAST Challenge 2021 and take challenge 3 as task to solve 4 questions involved.",
    "author": [
      {
        "name": "Tang Yue",
        "url": {}
      }
    ],
    "date": "2021-07-09",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-09T15:48:52+08:00",
    "input_file": "assignment.knit.md"
  },
  {
    "path": "posts/2021-06-16-dataviz-makeover-2/",
    "title": "DataViz Makeover 2- Singapore Merchandise Trade",
    "description": "A data visualization makeover for course ISSS608: Visual Analytics and Application",
    "author": [
      {
        "name": "Tang Yue",
        "url": {}
      }
    ],
    "date": "2021-06-16",
    "categories": [],
    "contents": "\r\nIn this DataViz Makeover, I have used data Merchandise Trade by Region/Market provided by Department of Statistics Singapore(DOS).\r\n1. Critique and Suggestions for Current Visualisation\r\nThe original visualization can be seen below.\r\n\r\n1.1 Clarity\r\nThe overlapped bubble results in readers having difficulties to estimate the total merchandise trade values for some countries such as Indonesia, Japan, Republic of Korea, which would be hard for readers to precisely identify the ‘’Net Importers’ and ‘Net Exporters’.\r\nThe difference between merchandise import and export for some countries with Singapore are quite small, the bubbles of this kind of countries are just on the separation line such as Japan, Unite State, which makes it hard to identify the countries’ import exceeds its export or export exceeds its import.\r\nThe unite of x axis and y axis are not indicated, which could confuse viewers the unite of import and export are billion or million.\r\nThe size of bubble charts reflects the total merchandise trade values across all countries, but it do not give the viewer a way to quickly and accurately identify the difference of the export and import trade volume.\r\nNo source data included. including source data at bottom of visualization would helpful to increase data reliability.\r\n1.2 Aesthetics\r\nThe color used for differentiate ‘Net Importers’ and ‘Net Exporters’ are not distinct, which cannot makes readers quickly clarify two groups of different relationship of import and export values.\r\nThe image are not necessary as it does not enhance the conveyance of information.\r\nThe chart looks too crowed and the label are very big, which would add reading difficulties for users.\r\n2. Alternative Design\r\nThe alternative design is as follows.\r\n\r\n2.1 Advantages of proposed design\r\nClarity\r\nTitle and subtitle explain key information and finding which would be used in chart, helping for readers’ understanding.\r\nY-axis and x-axis are added with unit, enabling reader easily understand the import and export volume across different years and countries.\r\nDumbbell chart clearly show the difference of import and export for Singapore merchandise with one country, which also make it possible to compare export and import vertically and horizontally.\r\nUse percentile to show the distribution of import and export for Singapore merchandise trade with major countries, which spread bubbles of countries into quadrant ’ High Import and High Export’, ’ High Import and Low Export’, ’ High Export and Low Import, Low Export and Low Import’, then countries would distinctly show their trade situation with Singapore.\r\nAdd the data source to describe the dataset used.\r\nAdd the Ranking of Import, Export and Total Trade Volume helps users better identify the distribution of import and export of Singapore merchandise trade across major partners.\r\nAesthetic\r\nThere are 4 distinct colors for 4 quadrant, which used in chart to identify four group of countries which have different import and export volume with Singapore.\r\nUse percentile to show the distribution of import and export for Singapore merchandise trade with major countries, which avoid the overlap of bubbles on the chart\r\nAnnotations are used to emphasize key observations,helping users quickly clarify the relationship between import and export for Singapore merchandise trade with one country.\r\n3. Final Visualisation\r\n\r\nThe final look of the data visualization makeover is shown in Figure 4. It is also available in Tableau Public\r\n4.0 Data visualisation steps\r\n4.1 Data Source\r\nIn remaking the existing visualisation, I used\r\nTable 1 – Merchandise Trade – Merchandise Imports By Region/Market, Monthly\r\nTable 2 – Merchandise Trade – Merchandise Exports By Region/Market, Monthly\r\nprovided by Merchandise Trade by Region/Market\r\n4.2 Data Cleaning and Preparation\r\n1. Data Cleaning with Excel\r\nTranspose data\r\nFor the convenience of data proprocessing, we transpose(rotate) data from rows to column. Click T1 sheet > Select the entire table > create a new sheet \r\nclick a empty cell > right click and select ‘Transpose’.\r\n\r\nRename the new sheet as ‘Import’. Repeat the transposing operation for T2 and rename as ‘Export’\r\n\r\nbecause study period is between January 2011-December 2020.Delete our target data is from January 1967 to December 2020. \r\n2. Data Preparation with Tableau\r\nLoad file\r\nopen Tableau and drag “output” file to the landing page of Tableau.\r\n\r\nDrag New Union to the workspace.\r\n\r\nDrag ‘Import’ and ‘Export’ into Union workplace.\r\n\r\nCheck Clean with Data Interpreter checkbox to allow Tableau to do automatic cleaning. Tableau is able to intelligently detect valuable columns and rows, and drop the empty ones.\r\n\r\nPivot data and further process data\r\nSelect all countries > right click and select pivot.\r\n\r\nRename headers to Country, Trading Volume, Date and Trading Category accordingly.\r\n\r\nThere is a column containing trading category information, so we hide th redundant column Table Name.\r\n\r\nClick column ‘Date’ and Change its data type from ‘String’ to ‘Date’.\r\n\r\nChange the unit of EU(European Union). Click Trading Volume < select Create Calculated Field < Using the below formula to change unit of EU. Next, Rename the original Trading Volume to Trading Volume1 and revised Trading Volume as Trading Volume.\r\n\r\n4.3 Data Visualization\r\n4.3.1 Dumbbell Chart of Singapore Import and Export Comparison\r\n1. Create Chart\r\nDrag the Country dimensions to columns and drag the Trading Volume measure to rows.\r\n\r\nWe care about Singapore merchandise trade with major countries, so we use filter to select major countries. Drag Country from Tables to Filters box > click Edit Filters.\r\n\r\nNext click None first and select Check 10 countries, they are ‘Hong kong’,‘Republic of Korea’, ‘Japan’,‘Taiwan’,‘Mainland China’,‘Unite State’, Indonesia’, ‘Thailand’, ’ Europe Union’ and ‘Taiwan’ respectively.\r\n\r\n4.Change the chart type to circle. click Marks > click Automatic < select Circle.\r\n\r\nDrag one more Trading Volume from Tables to Raws.\r\n\r\nNext Change similarly change the second chart type to Line.\r\n\r\nDrag the Trading Category from Tables to Color in Marks.\r\n\r\nClick the Size in Marks > Change Circle to desired size.\r\n\r\nSelect the second workplace in Marks, and drag ‘Trading Category’ into Path.\r\n\r\nLeft click on SUM(Trading Value) and select dual axis. \r\n2. Customization\r\nClick the y axis > right click > select synchronize axis\r\n\r\nClick the second axis > right click > unclick show header.\r\n\r\nclick the Country on the top of chart > right click > select Hide Field Labels for Columns.\r\n\r\nClick the country name at the x axis > right click > select Edit Alias.\r\n\r\nRevise Country name and remove their unit such as “Thousand Dollars” from name. Using the same way, we change all the countries name at x axis.\r\n\r\nDrag Date to the Filters, and select Years in Filter Fidel[Date] table.\r\n\r\nNext select date all the data from 2011 to 2020.\r\n\r\nClick the triangle of YEAR(Date) in Filters > select Show Filter, then Year filter are shown at the right corner of chart.\r\n\r\nClick the triangle of Year filter > select Single Value(list)\r\n\r\nRight click the chart title“Sheet”, and rename the new name of chart in the edit box.\r\n\r\nThe final chart of Import and Export volume Comparison of 10 countries is below.\r\n\r\n4.3.2 Bubble Chart of Singapore Merchandise Performance with Major Countries\r\n1. Create Chart\r\nCreate sheet2 to build new chart. Click Sheet2 at bottom.\r\n\r\nCreate measure Import and Export for further analysis. Click Analysis > select Create Calculated Field.\r\n\r\nNext create Import using the formula below, and we use the same method to create a new dimension Export.\r\n\r\nUsing the below formula to create Export represents the export volume.\r\n\r\nNext drag Import into Rows and Export into Column > Drag Country to Detail in Marks > Drag Trading Volume to Size in Marks.\r\n\r\nDrag Country into Filters to filter 9 countries > first click None > select 10 countries in country list, ‘Hong kong’,‘Janpan’,‘Taiwan’,‘Mainland China’,‘Unite State’ etc.\r\n\r\nClick the triangle of SUM(Export) in Columns > select Quick Calculation > Percentile.\r\n\r\nClick the triangle of SUM(Export) in Columns again > select Edit Table Calculation > Select the Specific Dimension and click Country.\r\n\r\nUsing the same way, we change the SUM(Import) in Rows into Percentile.\r\n\r\nClick Edit Calculation > select Specific Dimensions and make sure Country is checked as well.\r\n\r\nDrag the SUM(Import) in Rows and SUM(Export) in Columns into Tables, and rename them as “Import Percentile” and \" Export Percentile\" respectively. Then the SUM(Import) in Rows and SUM(Export) in Columns would change into “Import Percentile” and \" Export Percentile\" as shown below.\r\n\r\nclick Export Percentile in Tables > select Default Properties > Number Format\r\n\r\nSelect Percentage and change the Decimal Places to 0. And we use the same method to change the Import Percentile as well, then Import Percentile and Import Percentile change into percentage.\r\n\r\nNext Change the chart type. Click the triangle in Marks and select Circle.\r\n\r\nNext add reference line. Click Analytic beside Data > Drag Constant Line to chart, then box of Reference Line showed out and drag into Export Percentile. use the same way,\r\n\r\nEdit the reference Value to 0.5. Using the same way, we add the reference line for Export Percentile.\r\n\r\nNext we edit the reference line. Right click the reference line > select Edit > select the Label to NOne.\r\n\r\nContinue editing reference line. click Format to edit reference line > Click the triangle of Line on the left > select desired line format. Use the same method, add reference line for Import Percentile.\r\n\r\nCreate Color dimension to identify countries in different quadrant, which would be easier for readers to identify countries with various export and high volume. First click Analysis > select Create Calculated Filed > Add one dimension Color using the below formula.\r\n\r\nNext drag dimension Color into Color in Marks, then countries would painted with same colors if they are in the same quadrant.\r\n\r\nAdding countries name on bubble would helps reviewers to identify countries. Drag Country into Label.\r\n\r\nChange the color of bubble based on needs. Click Color in Marks > change Opacity to desired color.\r\n\r\nNext create Ranking of Export and Import. Click Analysis > Create Calculated Filed > add new dimension Ranking of Import as below formula > click Default Table Calculation.\r\n\r\nNext Change the Computing Using from Automation to Country. Using the same way, we create Ranking of Export and Ranking of Total Trading Volume.\r\n\r\nDrag Ranking of Export and Ranking of Import into Tooltip in Marks.\r\n\r\nTo make the chart more interactive, we add more flexible options for users to select. Add Date to Filter > select Year.\r\n\r\nNext select year from 2011 to 2020 in the selection box, next click OK.\r\n\r\nAfter adding the Year filter,we show the filter on charts for user to select. Right click Year in Filter > select Show Filter\r\n\r\nNext we edit Year Filter to be more interactive and easy-operation. click Year filter at the right corner > select Single Value(List)\r\n\r\n2. Customization\r\nRight click chart title > click Edit < edit the Chart title above the chart.\r\n\r\nTo make the chart be more concise, hide Right the chart of SUM(Trading Volume) at the right side. click SUM(Trading Volume) < select Hide Card\r\n\r\nset two chart share the same Year Filter. Click the triangle of Year filter > click Applied to Worksheet > select All Using This Source.\r\n\r\nFinally, the visualization dashboard for 10 Trading Countries with Singapore has been completed.\r\n\r\n5. Derived Insight\r\nInsight 1: In 2020, 10 Singapore Merchandise Trade partners could be divided into two group. one group is the countries whose value of Export exceeds import, they are Hong Kong, Mainland China, Indonesia and Malaysia. The another group whose import exceed export are EU, Japan, Korea, Thailand and Unite State.\r\nInsight 2: From 2011 to 2020, the difference of import and export volume for Singapore merchandise trade with Hong Kong always was the largest across all trade partners.And the smallest difference between import and export usually could be seen in Japan and Korea.\r\nInsight 3: between year 2011 and 2018, the value of export exceeds import for Singapore merchandise with Malaysia, however, after year 2019 Singapore merchandise import from Malaysia exceeds its export to Malaysia. Besides, since year 2020, Singapore merchandise export to Unite State exceeds its import from Unite State, prior to 2020, the import and export situation for them are opposite.\r\nInsight 4: The high export and high import countries with Singapore merchandise trade always keep 3 countries: Mainland, EU and Malaysia, but since year 2019, Unite State entered the high export and high import list.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-21T00:06:10+08:00",
    "input_file": "dataviz-makeover-2-singapore-merchandise-trade.knit.md"
  },
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1- Singapore Merchandise Trade",
    "description": "A data visualization makeover for course ISSS608: Visual Analytics and Application",
    "author": [
      {
        "name": "Tang Yue",
        "url": {}
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\nIn this DataViz Makeover, I have used data Merchandise Trade by Region/Market provided by Department of Statistics Singapore(DOS).\r\n1. Critique and Suggestions for Visualisation\r\nThe original visualization can be seen below.\r\n\r\n1.1 Clarity\r\nArea charts are ambiguous for user to read the exact values of data.The stacked area graph comprises subcategories that add up to a total value for each value on the x-axis, thus export and import volumes per year for each country is hidden.\r\n6 Area charts were presented in 6 charts separately, which do not give the viewer a way to quickly and accurately compare the export and import trade volume of 6 countries.\r\nThere is no tick marks and month values on x-axis, but tick marks are necessary on continuous scale. It would be hard to clarify time scale and compare import and export volume over time.\r\ny-axis not inconsistently labeled. The unit of import volume is ‘k’ in chart ‘Hong Kong’,but the unit for import and export volume for other charts are ‘M’. this leaves room for misinterpretation and/or requires the reader’s extra time to peruse the chart.\r\nno month values on x-axis. The x-axis shows x would be ‘Month of Period’, but x-axis just shows year values. The discrepancy would confuse readers how to understand the time scale.\r\nNo source data included. including source data at bottom of visualization would helpful to increase data reliability.\r\n1.2 Aesthetics\r\nthe chart is not exported in good quality. It is quite pixelated, even in the original report.\r\nThe subtitle is not in line with the charts and front size of subtitle is bigger than main title.\r\nthere is poor use of colors in the chart. the overlap color is not distinct from colors of export and import data,which may cause difficulty for readers to identify and understand.\r\nthe names of y-axis,‘Export’ and ‘import’, do not precisely drive the message of ‘the export and import merchandise trade volume’. the too concise y-axis name would cause ambiguity.\r\nNo call out to provide context. If static chart, include call outs, text or images to enhance the chart. If interactive, include tooltip details and ability to filter.\r\n2. Alternative Design\r\nThe alternative design is as follows. \r\n2.1 Advantages of proposed design\r\nClarity\r\nTitle and subtitle explain key information and finding which would be used in chart, helping for readers’ understanding.\r\nY-axis is added to enable the reader to read and compare import and export volume across different years and countries more easily.\r\nDumbbell chart clearly show the vertical relationship between import,export, countries across years, which enables easy identification of changes over time and trends as there is a visual representation of these changes.\r\nAdd a circle plot to show Percent Difference compared with previous year (Import and Export) by age countries, which would provide reader information not only the absolute values of trading volume but also the growth rate or decrease rate of trading volume.\r\nAesthetic\r\nAnnotations are used to emphasize key observations. Color is used to bring to attention different categories (e.g.different trading categories).\r\nChart titles and notes are aligned to the main chart.\r\nSix countries have been put in one chart which would be easier for users to compare the difference on import and export values in vertical or horizontal ways.\r\nTime scope from 2019-2020 on x axis keep consistent without confusion.\r\n3. Final Visualisation\r\n The final look of the data visualization makeover is shown in Figure 4. It is also available in Tableau Public.\r\n4.0 Data visualisation steps\r\n4.1 Data Source\r\nIn remaking the existing visualisation, I used\r\nTable 1 – Merchandise Trade – Merchandise Imports By Region/Market, Monthly\r\nTable 2 – Merchandise Trade – Merchandise Exports By Region/Market, Monthly\r\nprovided by Merchandise Trade by Region/Market\r\n4.2 Data Cleaning and Preparation\r\n1. Data Cleaning with Excel\r\nRemove unnecessary column and rows\r\nour target data is between 20019-2020, thus we remove trade data from 1976 Jan to 2018 Dec for Table 1 and Table 2.\r\nAnd remove Content and data descriptions including Subject, Topic and Title, as well as empty raw.\r\n\r\nTranspose data\r\nFor the convenience of data proprocessing, we transpose(rotate) data from rows to column.\r\n\r\nTake the same method, we preprocessed Table 1 and Table2\r\nRename Table 1 as ‘Import’ and Table 2 2 as ‘Export’ save file as ‘Merchandise Trade_v1’.\r\n\r\n2. Data Preparation with Tableau\r\nLoad file\r\nCreate a new workbook and click Connect to Data. \r\nChoose the file type > file name ‘Merchandise Trade_v1’. \r\nCheck Clean with Data Interpreter checkbox to allow Tableau to do automatic cleaning. Tableau is able to intelligently detect valuable columns and rows, and drop the empty ones.\r\nDrag the table Export that we want to the canvas. \r\nPivot data and create cleaned file\r\nSelect import data between 2019 to 2020 are spread across multiple country. Select all countries and right click and select pivot.\r\n\r\nRename headers Date, Country and Import accordingly. \r\nUse Tableau to pivot data in sheet with measure values in columns and age in rows. And remove CNT in Measure Values. \r\nClick Analysis to review data in Tableau.\r\n\r\nExport data and save the file with an appropriate name. \r\nRepeat step 2 for both Export and Import data. Merge the exported two tables using Excel and add a category column to identify the dataset source. \r\n4.3 Data Visualization\r\nImport the cleaned dataset into Tableau. \r\nRename Column header. Changed the original column headers in Pivot Field Names and make their name easier to understand.Rename Export and Import values column to Trade Volume.\r\n\r\nChange data type. Change the data type from String to Date. \r\n4. Create Chart\r\nAdd Country, Date and Trade Volume to the Rows and Column \r\nFilter Top 6 Country with highest merchandise trade volume. Check ‘Hong kong’,‘Janpan’,‘Taiwan’,‘Mainland China’,‘Unite State’. \r\nTop 6 trading countries have been selected for further analysis and visualization.\r\n\r\nFilter data in year 2021 because we forgot to Remove data in year 2021 in data preprocess, then we use filter to exclude 2021 year data. Below chart present the import and export volume trend from year 2019 to year2020. \r\n5. Customization\r\nAdd Label data on chart.\r\nClick Label in Text Mark Card\r\nSelect Show Mark Label and click Line Ends to make the labels only appear on the line end. Otherwise, the chart would be too cluttered. \r\nChange axis and data unit\r\nRight-click on one of the labels > click Format to open the Format Pane.\r\nClick on Field and select Axis, Change Number axis unit to Million. \r\nClick Pane > Default > change Number to Million. \r\nDelete country suffix and alias.\r\nRight click country name and select Edit Alias. \r\nRemove Thousand Dollars from Country name. \r\nRight Y axis and Unclick shown header \r\nFit Width. To fix width, click Standard > select Fit Width potion. \r\nThe basic graph should look like this. \r\nAdd another SUM(Trade Volume) to create dual axis. \r\nRight click on the bottom Y-axis and select dual axis chart.\r\n\r\nRight click on the right Y-axis, select Synchronize Axis and deselect Show Header. \r\nChange panel from Automatic to Circle to show marks in the main graph \r\nClick the Size in Marks and resize to desired level.\r\n\r\nDrag one more SUM(Trade Volume) in the Rows table > click the down arrow > click Create a Quick Table Calculation > select Percent Difference.\r\n\r\nSelect Edit Table Calculation and click Pane (across) option.\r\n\r\nDouble click the second SUM(Trade Volume) in Row tab, copy the formula.\r\n\r\nCreate a calculated field for Difference variable for Positive and Negative values. Repeat for the positive values.\r\n\r\nPaste the formula above for the Difference formula \r\nUse the following formula to create Negative and Positive values. \r\nRepeat for the positive values. \r\nDrag both the Negative and Positive values to the second axis in label tab.\r\nclick Label in Marks > click Show Mark Labels > select the Most Recent option > select Scope in Pane\r\nselect the Text to recolor Negative text to Red \r\nRight click on the main graph area and select annotate.\r\nType in insights and observations in the text area.\r\nArrange, resize, or format the resulting text box if required. \r\nFinally, the visualization dashboard for Top 6 Trading Countries has been completed.\r\n\r\n5. Derived Insight\r\ninsight 1: Singapore merchandises exports to top countries all increase except that to Malaysia which underwent decrease.\r\nfrom the chart, we can see from 2019 to 2020, Singapore’s export show increase in five top countries, Hong Kong, Japan, Mainland China, Taiwan and US, but Only Singapore export to Malaysia experienced the decrease with only and large decrease rate, -18.24%.\r\nInsight 2: Singapore largest import and export trade partner is Mainland China and its import and export with China are most stable from 2019 to 2020\r\nThe total trade volume of Singapore import and export with China rank 1st among 6 countries form 2019 to 2020, no matter the import to china or export from china, the change rates for both of them are lowest among those of other 5 countries, 0.68% and -2.28% respectively.\r\nInsight 3: The import and export between Singapore and US experienced largest change rate from 2019 to 2020.\r\nSingapore merchandise import from US experienced biggest decrease among top 6 countries from 2019 to 2020. HOwever, at the same time, Singapore merchandise export to US remarkably increase with largest growth rate among top 6 countries, 19.29%.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-16T21:23:12+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  }
]
