[
  {
    "path": "posts/2021-05-22-dataviz-makeover-1/",
    "title": "DataViz Makeover 1- Singapore Merchandise Trade",
    "description": "A data visualization makeover for course ISSS608: Visual Analytics and Application",
    "author": [
      {
        "name": "Tang Yue",
        "url": {}
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\nIn this DataViz Makeover, I have used data Merchandise Trade by Region/Market provided by Department of Statistics Singapore(DOS).\r\n1. Critique and Suggestions for Visualisation\r\nThe original visualization can be seen below.\r\n\r\n1.1 Clarity\r\nArea charts are ambiguous for user to read the exact values of data.The stacked area graph comprises subcategories that add up to a total value for each value on the x-axis, thus export and import volumes per year for each country is hidden.\r\n6 Area charts were presented in 6 charts separately, which do not give the viewer a way to quickly and accurately compare the export and import trade volume of 6 countries.\r\nThere is no tick marks and month values on x-axis, but tick marks are necessary on continuous scale. It would be hard to clarify time scale and compare import and export volume over time.\r\ny-axis not inconsistently labeled. The unit of import volume is ‘k’ in chart ‘Hong Kong’,but the unit for import and export volume for other charts are ‘M’. this leaves room for misinterpretation and/or requires the reader’s extra time to peruse the chart.\r\nno month values on x-axis. The x-axis shows x would be ‘Month of Period’, but x-axis just shows year values. The discrepancy would confuse readers how to understand the time scale.\r\nNo source data included. including source data at bottom of visualization would helpful to increase data reliability.\r\n1.2 Aesthetics\r\nthe chart is not exported in good quality. It is quite pixelated, even in the original report.\r\nThe subtitle is not in line with the charts and front size of subtitle is bigger than main title.\r\nthere is poor use of colors in the chart. the overlap color is not distinct from colors of export and import data,which may cause difficulty for readers to identify and understand.\r\nthe names of y-axis,‘Export’ and ‘import’, do not precisely drive the message of ‘the export and import merchandise trade volume’. the too concise y-axis name would cause ambiguity.\r\nNo call out to provide context. If static chart, include call outs, text or images to enhance the chart. If interactive, include tooltip details and ability to filter.\r\n2. Alternative Design\r\nThe alternative design is as follows. \r\n2.1 Advantages of proposed design\r\nClarity\r\nTitle and subtitle explain key information and finding which would be used in chart, helping for readers’ understanding.\r\nY-axis is added to enable the reader to read and compare import and export volume across different years and countries more easily.\r\nDumbbell chart clearly show the vertical relationship between import,export, countries across years, which enables easy identification of changes over time and trends as there is a visual representation of these changes.\r\nAdd a circle plot to show Percent Difference compared with previous year (Import and Export) by age countries, which would provide reader information not only the absolute values of trading volume but also the growth rate or decrease rate of trading volume.\r\nAesthetic\r\nAnnotations are used to emphasize key observations. Color is used to bring to attention different categories (e.g.different trading categories).\r\nChart titles and notes are aligned to the main chart.\r\nSix countries have been put in one chart which would be easier for users to compare the difference on import and export values in vertical or horizontal ways.\r\nTime scope from 2019-2020 on x axis keep consistent without confusion.\r\n3. Final Visualisation\r\n The final look of the data visualization makeover is shown in Figure 4. It is also available in Tableau Public.\r\n4.0 Data visualisation steps\r\n4.1 Data Source\r\nIn remaking the existing visualisation, I used\r\nTable 1 – Merchandise Trade – Merchandise Imports By Region/Market, Monthly\r\nTable 2 – Merchandise Trade – Merchandise Exports By Region/Market, Monthly\r\nprovided by Merchandise Trade by Region/Market\r\n4.2 Data Cleaning and Preparation\r\n1. Data Cleaning with Excel\r\nRemove unnecessary column and rows\r\nour target data is between 20019-2020, thus we remove trade data from 1976 Jan to 2018 Dec for Table 1 and Table 2.\r\nAnd remove Content and data descriptions including Subject, Topic and Title, as well as empty raw.\r\n\r\nTranspose data\r\nFor the convenience of data proprocessing, we transpose(rotate) data from rows to column.\r\n\r\nTake the same method, we preprocessed Table 1 and Table2\r\nRename Table 1 as ‘Import’ and Table 2 2 as ‘Export’ save file as ‘Merchandise Trade_v1’.\r\n\r\n2. Data Preparation with Tableau\r\nLoad file\r\nCreate a new workbook and click Connect to Data. \r\nChoose the file type > file name ‘Merchandise Trade_v1’. \r\nCheck Clean with Data Interpreter checkbox to allow Tableau to do automatic cleaning. Tableau is able to intelligently detect valuable columns and rows, and drop the empty ones.\r\nDrag the table Export that we want to the canvas. \r\nPivot data and create cleaned file\r\nSelect import data between 2019 to 2020 are spread across multiple country. Select all countries and right click and select pivot.\r\n\r\nRename headers Date, Country and Import accordingly. \r\nUse Tableau to pivot data in sheet with measure values in columns and age in rows. And remove CNT in Measure Values. \r\nClick Analysis to review data in Tableau.\r\n\r\nExport data and save the file with an appropriate name. \r\nRepeat step 2 for both Export and Import data. Merge the exported two tables using Excel and add a category column to identify the dataset source. \r\n4.3 Data Visualization\r\nImport the cleaned dataset into Tableau. \r\nRename Column header. Changed the original column headers in Pivot Field Names and make their name easier to understand.Rename Export and Import values column to Trade Volume.\r\n\r\nChange data type. Change the data type from String to Date. \r\n4. Create Chart\r\nAdd Country, Date and Trade Volume to the Rows and Column \r\nFilter Top 6 Country with highest merchandise trade volume. Check ‘Hong kong’,‘Janpan’,‘Taiwan’,‘Mainland China’,‘Unite State’. \r\nTop 6 trading countries have been selected for further analysis and visualization.\r\n\r\nFilter data in year 2021 because we forgot to Remove data in year 2021 in data preprocess, then we use filter to exclude 2021 year data. Below chart present the import and export volume trend from year 2019 to year2020. \r\n5. Customization\r\nAdd Label data on chart.\r\nClick Label in Text Mark Card\r\nSelect Show Mark Label and click Line Ends to make the labels only appear on the line end. Otherwise, the chart would be too cluttered. \r\nChange axis and data unit\r\nRight-click on one of the labels > click Format to open the Format Pane.\r\nClick on Field and select Axis, Change Number axis unit to Million. \r\nClick Pane > Default > change Number to Million. \r\nDelete country suffix and alias.\r\nRight click country name and select Edit Alias. \r\nRemove Thousand Dollars from Country name. \r\nRight Y axis and Unclick shown header \r\nFit Width. To fix width, click Standard > select Fit Width potion. \r\nThe basic graph should look like this. \r\nAdd another SUM(Trade Volume) to create dual axis. \r\nRight click on the bottom Y-axis and select dual axis chart.\r\n\r\nRight click on the right Y-axis, select Synchronize Axis and deselect Show Header. \r\nChange panel from Automatic to Circle to show marks in the main graph \r\nClick the Size in Marks and resize to desired level.\r\n\r\nDrag one more SUM(Trade Volume) in the Rows table > click the down arrow > click Create a Quick Table Calculation > select Percent Difference.\r\n\r\nSelect Edit Table Calculation and click Pane (across) option.\r\n\r\nDouble click the second SUM(Trade Volume) in Row tab, copy the formula.\r\n\r\nCreate a calculated field for Difference variable for Positive and Negative values. Repeat for the positive values.\r\n\r\nPaste the formula above for the Difference formula \r\nUse the following formula to create Negative and Positive values. \r\nRepeat for the positive values. \r\nDrag both the Negative and Positive values to the second axis in label tab.\r\nclick Label in Marks > click Show Mark Labels > select the Most Recent option > select Scope in Pane\r\nselect the Text to recolor Negative text to Red \r\nRight click on the main graph area and select annotate.\r\nType in insights and observations in the text area.\r\nArrange, resize, or format the resulting text box if required. \r\nFinally, the visualization dashboard for Top 6 Trading Countries has been completed.\r\n\r\n5. Derived Insight\r\ninsight 1: Singapore merchandises exports to top countries all increase except that to Malaysia which underwent decrease.\r\nfrom the chart, we can see from 2019 to 2020, Singapore’s export show increase in five top countries, Hong Kong, Japan, Mainland China, Taiwan and US, but Only Singapore export to Malaysia experienced the decrease with only and large decrease rate, -18.24%.\r\nInsight 2: Singapore largest import and export trade partner is Mainland China and its import and export with China are most stable from 2019 to 2020\r\nThe total trade volume of Singapore import and export with China rank 1st among 6 countries form 2019 to 2020, no matter the import to china or export from china, the change rates for both of them are lowest among those of other 5 countries, 0.68% and -2.28% respectively.\r\nInsight 3: The import and export between Singapore and US experienced largest change rate from 2019 to 2020.\r\nSingapore merchandise import from US experienced biggest decrease among top 6 countries from 2019 to 2020. HOwever, at the same time, Singapore merchandise export to US remarkably increase with largest growth rate among top 6 countries, 19.29%.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T22:04:01+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  }
]
